---
kind: other
id: Methods.T:Autodesk.Revit.DB.SiteLocation
source: html/455ff722-76fa-813f-6a3d-f9e2c314f05f.htm
---
# SiteLocation Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.